In [18]:
print("skmvks")

skmvks

In [19]:
import zipfile

with zipfile.ZipFile("walmart-10k-sales-datasets.zip", 'r') as zip_ref:
    zip_ref.extractall("unzipped_data")

print("Unzipped successfully!")

Unzipped successfully!

In [20]:
import pandas as pd
print(pd.__version__)

2.3.1

In [21]:
#load csv file
df = pd.read_csv('unzipped_data/Walmart.csv', encoding_errors='ignore')
print(df.shape)
df.head()

(10051, 11)

,invoice_id,Branch,City,category,unit_price,quantity,date,time,payment_method,rating,profit_margin
0,1,WALM003,San Antonio,Health and beauty,$74.69,7.0,05/01/19,13:08:00,Ewallet,9.1,0.48
1,2,WALM048,Harlingen,Electronic accessories,$15.28,5.0,08/03/19,10:29:00,Cash,9.6,0.48
2,3,WALM067,Haltom City,Home and lifestyle,$46.33,7.0,03/03/19,13:23:00,Credit card,7.4,0.33
3,4,WALM064,Bedford,Health and beauty,$58.22,8.0,27/01/19,20:33:00,Ewallet,8.4,0.33
4,5,WALM013,Irving,Sports and travel,$86.31,7.0,08/02/19,10:37:00,Ewallet,5.3,0.48

In [22]:
#removing dollar sign and changing data type from str to float
df['unit_price'] = df['unit_price'].str.replace('$','').astype(float)
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10051 entries, 0 to 10050
Data columns (total 11 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   invoice_id      10051 non-null  int64
 1   Branch          10051 non-null  object
 2   City            10051 non-null  object
 3   category        10051 non-null  object
 4   unit_price      10020 non-null  float64
 5   quantity        10020 non-null  float64
 6   date            10051 non-null  object
 7   time            10051 non-null  object
 8   payment_method  10051 non-null  object
 9   rating          10051 non-null  float64
 10  profit_margin   10051 non-null  float64
dtypes: float64(4), int64(1), object(6)
memory usage: 863.9+ KB

In [23]:
#creating new column total
df['Total'] = df['unit_price'] * df['quantity']

In [24]:
df.head()

,invoice_id,Branch,City,category,unit_price,quantity,date,time,payment_method,rating,profit_margin,Total
0,1,WALM003,San Antonio,Health and beauty,74.69,7.0,05/01/19,13:08:00,Ewallet,9.1,0.48,522.83
1,2,WALM048,Harlingen,Electronic accessories,15.28,5.0,08/03/19,10:29:00,Cash,9.6,0.48,76.40
2,3,WALM067,Haltom City,Home and lifestyle,46.33,7.0,03/03/19,13:23:00,Credit card,7.4,0.33,324.31
3,4,WALM064,Bedford,Health and beauty,58.22,8.0,27/01/19,20:33:00,Ewallet,8.4,0.33,465.76
4,5,WALM013,Irving,Sports and travel,86.31,7.0,08/02/19,10:37:00,Ewallet,5.3,0.48,604.17

In [28]:
df.drop_duplicates(inplace= True)
df.duplicated().sum()
df.dropna(inplace= True)
df.shape

(9969, 12)

In [25]:
import pymysql #works as adapter
from sqlalchemy import create_engine

In [ ]:
from urllib.parse import quote_plus

username = 'root'
raw_password = 'Dileep@7130'
encoded_password = quote_plus(raw_password)

connection_string = f'mysql+pymysql://{username}:{encoded_password}@localhost:3306/walmart_database'
engine_mysql = create_engine(connection_string)
try:
    engine_mysql
    print("Yes")
except:
    print("No")

Yes

In [32]:
df.to_sql(name ='Walmart', con = engine_mysql, if_exists = 'append', index=False)

C:\Users\Dilee\AppData\Local\Temp\ipykernel_1868\4112216938.py:1: UserWarning: The provided table name 'Walmart' is not found exactly as such in the database after writing the table, possibly due to case sensitivity issues. Consider using lower case table names.
  df.to_sql(name ='Walmart', con = engine_mysql, if_exists = 'append', index=False)

9969